[
  {
    "version": "1.2.2",
    "date": "2025-11-27",
    "title": "Bug Fixes",
    "description": "",
    "features": [],
    "bugfixes": [
      "Resolved an issue where a user's last active time was not updating correctly."
    ],
    "improvements": [],
    "technical": []
  },
  {
    "version": "1.2.1",
    "date": "2025-11-23",
    "title": "Small enhancements and bug fixes",
    "description": "",
    "features": [
      "You can now view player's votes on bills from the bill details page."
    ],
    "bugfixes": [
      "Fixed mobile responsiveness issues on the bills page."
    ],
    "improvements": [
      "The back button on the bill details page now navigates back to the previous page if possible.",
      "Added more options for party logos."
    ],
    "technical": [
      "~475 lines of code added.",
      "~20 lines of code removed."
    ]
  },
  {
    "version": "1.2.0",
    "date": "2025-11-22",
    "title": "Quality of Life Update",
    "description": "This small update focuses on improving the user experience with nice quality of life features and enhancements.",
    "features": [
      "Accounts will be marked as inactive after 7 days of inactivity. Inactive accounts will be removed from their parties and will not be visible in user lists. Accounts can be reactivated by logging back in.",
      "Bills are now truncated to improve readability. Users can click 'Read More' to view the full content of a bill."
    ],
    "bugfixes": [],
    "improvements": [
      "Improved vote indicator design."
    ],
    "technical": [
      "~750 lines of code added.",
      "~150 lines of code removed."
    ]
  },
  {
    "version": "1.1.1",
    "date": "2025-11-10",
    "title": "Minor Update",
    "description": "This minor update includes small improvements and bug fixes to improve user experience.",
    "features": [],
    "bugfixes": [
      "Fixed an issue with party initials grabbing special characters.",
      "Fixed a critical bug where the game would trigger multiple advance steps in a single day. We have retroactively corrected the game state and apologize for any inconvenience caused."
    ],
    "improvements": [
      "Consolidated the parties and party leaderboard page into a single parties page.",
      "You can now add a discord invite to your party page."
    ],
    "technical": []
  },
  {
    "version": "1.1.0",
    "date": "2025-11-09",
    "title": "The Enhancements Update",
    "description": "Welcome to our first major update! This release brings a lot of exciting new features and improvements, aimed towards enhancing the overall user experience and engagement within the game.",
    "features": [
      "A new bill will become available every 8 hours, and then enter a 24-hour voting period.",
      "You can now create a party logo within the game.",
      "Added a party leaderboard page. Parties are ranked by total number of members.",
      "You can now drop out of an election before voting begins.",
      "You can now edit your queued bills.",
      "You can now merge parties. Party leaders can send merge requests to other parties, which can then be accepted or rejected by the target party.",
      "You can now drop out of an election before voting begins.",
      "You can now vote for multiple candidates in Senate elections, up to the number of available seats."
    ],
    "bugfixes": [
      "Formatting is now preserved in bill content. This includes line breaks and spacing. Formatting has also been retroactively fixed to existing bills where applicable."
    ],
    "improvements": [
      "Bill filtering has been streamlined.",
      "Modified how we allocate the number of senate seats per election."
    ],
    "technical": [
      "~4200 lines of code added.",
      "~1300 lines of code removed."
    ]
  },
  {
    "version": "1.0.3",
    "date": "2025-11-04",
    "title": "Hotfix Release",
    "description": "This hotfix release includes small improvements and bug fixes to enhance user experience.",
    "features": [],
    "bugfixes": [],
    "improvements": [
      "The game step now runs at 8pm UTC daily, instead of midnight UTC.",
      "We have added confirmation prompts for multiple user actions to prevent accidental submissions.",
      "Improved account deletion for banned users."
    ],
    "technical": []
  },
  {
    "version": "1.0.2",
    "date": "2025-11-03",
    "title": "Hotfix Release",
    "description": "This hotfix release focuses on resolving issues regarding user management, and improving the overall user experience.",
    "features": [],
    "bugfixes": [
      "Resolved issues with banned user content still displaying."
    ],
    "improvements": [
      "Parties are now disbanded when the last member leaves. Parties that are currently without members will be automatically disbanded on next game step."
    ],
    "technical": []
  },
  {
    "version": "1.0.1",
    "date": "2025-11-02",
    "title": "Hotfix Release",
    "description": "This hotfix addresses a data fetching issue.",
    "features": [],
    "bugfixes": [
      "Fixed issue where user lookups were case-sensitive, preventing some users from being found.",
      "Fixed an issue where the bill status would always return defeated, even if it had moved onto the next stage of the legislative process. We have manually corrected the statuses of bills that have been affected."
    ],
    "improvements": [
      "We have introduced a dashboard for site administrators to assist with user management."
    ],
    "technical": []
  },
  {
    "version": "1.0.0",
    "date": "2025-11-02",
    "title": "Initial Release",
    "description": "Welcome to democracyonline.io! We are happy to have our initial release of our game live, allowing players to engage in a virtual democracy!",
    "features": [
      "User registration and authentication system.",
      "Create and join political parties.",
      "Propose and vote on legislation.",
      "Run for office in Senate and Presidential elections.",
      "Vote in elections.",
      "Real-time chat and communication.",
      "User profiles and customization.",
      "Activity feed to stay updated on political developments.",
      "Party management tools for leaders and members."
    ],
    "bugfixes": [],
    "improvements": [],
    "technical": []
    }
]